# GNU utilities (replace BSD defaults on macOS)
# Packages with gnubin (added to PATH in .zsh/gnu-utils.zsh):
brew 'coreutils'
brew 'diffutils'
brew 'findutils'
brew 'gawk'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'grep'

# GNU utilities without gnubin (install to homebrew bin, already in PATH):
brew 'ed'
brew 'gzip'
brew 'watch'
brew 'wdiff'
brew 'wget'

# Core tools
brew 'git'

# Version and package management
brew 'asdf'
brew 'pdm'

# Fonts
cask 'font-cascadia-code'
